TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G5187/msp_subsystems/scanning_comparator/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the LP_MSPM0G5187
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_LP_MSPM0G5187
#define CONFIG_MSPM0G5187

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000




/* Defines for COMP */
#define COMP_INST                                                          COMP0
#define COMP_INST_INT_IRQN                                        COMP0_INT_IRQn

/* Defines for COMP DACCODE0 */
#define COMP_DACCODE0                                                       (39)


/* GPIO configuration for COMP */
#define GPIO_COMP_IN0P_PORT                                              (GPIOB)
#define GPIO_COMP_IN0P_PIN                                      (DL_GPIO_PIN_21)
#define GPIO_COMP_IOMUX_IN0P                                     (IOMUX_PINCM49)
#define GPIO_COMP_IOMUX_IN0P_FUNC                 (IOMUX_PINCM49_PF_UNCONNECTED)





/* Port definition for Pin Group COMP_OUTPUT */
#define COMP_OUTPUT_PORT                                                 (GPIOA)

/* Defines for A: GPIOA.15 with pinCMx 37 on package pin 8 */
#define COMP_OUTPUT_A_PIN                                       (DL_GPIO_PIN_15)
#define COMP_OUTPUT_A_IOMUX                                      (IOMUX_PINCM37)
/* Defines for B: GPIOA.16 with pinCMx 38 on package pin 9 */
#define COMP_OUTPUT_B_PIN                                       (DL_GPIO_PIN_16)
#define COMP_OUTPUT_B_IOMUX                                      (IOMUX_PINCM38)
/* Defines for C: GPIOA.12 with pinCMx 34 on package pin 5 */
#define COMP_OUTPUT_C_PIN                                       (DL_GPIO_PIN_12)
#define COMP_OUTPUT_C_IOMUX                                      (IOMUX_PINCM34)


/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_COMP_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
